## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/4ea0e9da-e642-4fc9-9292-48dd849a9da0/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "australiaeast"
      + login_server                  = (known after apply)
      + name                          = "acrbiotrackrprodae"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-biotrackr-prod-ae"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.acr_pull_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.usi.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "uai-biotrackr-prod-ae"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-biotrackr-prod-ae"
      + tags                = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + tenant_id           = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.azurerm_container_registry.acr will be created%0A  + resource "azurerm_container_registry" "acr" {%0A      + admin_enabled                 = true%0A      + admin_password                = (sensitive value)%0A      + admin_username                = (known after apply)%0A      + encryption                    = (known after apply)%0A      + export_policy_enabled         = true%0A      + id                            = (known after apply)%0A      + location                      = "australiaeast"%0A      + login_server                  = (known after apply)%0A      + name                          = "acrbiotrackrprodae"%0A      + network_rule_bypass_option    = "AzureServices"%0A      + network_rule_set              = (known after apply)%0A      + public_network_access_enabled = true%0A      + resource_group_name           = "rg-biotrackr-prod-ae"%0A      + retention_policy              = (known after apply)%0A      + sku                           = "Basic"%0A      + tags                          = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + trust_policy                  = (known after apply)%0A      + zone_redundancy_enabled       = false%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A    }%0A%0A  # module.acr_pull_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "AcrPull"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.usi.azurerm_user_assigned_identity.msi will be created%0A  + resource "azurerm_user_assigned_identity" "msi" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "australiaeast"%0A      + name                = "uai-biotrackr-prod-ae"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "rg-biotrackr-prod-ae"%0A      + tags                = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + tenant_id           = (known after apply)%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>